## Objetivo: Unir 2 databases de empresas que estão se fundindo

Lendo dados

In [6]:
import pandas as pd

In [7]:
dados_json = pd.read_json('C:/Users/gabrielbrito/Alura/PythonParaDataScience/Curso_1/Data_Raw/dados_empresaA.json')
dados_csv = pd.read_csv('C:/Users/gabrielbrito/Alura/PythonParaDataScience/Curso_1/Data_Raw/dados_empresaB.csv')

In [8]:
dados_csv.head()

,Nome do Item,Classificação do Produto,Valor em Reais (R$),Quantidade em Estoque,Nome da Loja,Data da Venda
0,Lápis de sobrancelha,Roupas,55.17,62,Filial 1,2023-04-13 18:58:06.794203
1,Batom matte,Eletrônicos,74.15,48,Filial 9,2023-06-03 18:58:06.794203
2,Corretivo,Roupas,54.86,36,Filial 5,2023-06-08 18:58:06.794203
3,Delineador líquido,Roupas,91.29,1,Filial 8,2023-02-27 18:58:06.794203
4,Batom líquido,Roupas,44.65,52,Filial 2,2022-09-05 18:58:06.794203

In [9]:
dados_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1323 entries, 0 to 1322
Data columns (total 6 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Nome do Item              1323 non-null   object
 1   Classificação do Produto  1323 non-null   object
 2   Valor em Reais (R$)       1323 non-null   float64
 3   Quantidade em Estoque     1323 non-null   int64
 4   Nome da Loja              1323 non-null   object
 5   Data da Venda             1323 non-null   object
dtypes: float64(1), int64(1), object(4)
memory usage: 62.1+ KB

In [10]:
dados_json.head()

,Nome do Produto,Categoria do Produto,Preço do Produto (R$),Quantidade em Estoque,Filial
0,Blush em pó,Eletrodomésticos,79.41,7,Filial 7
1,Lápis de sobrancelha,Eletrodomésticos,85.47,78,Filial 8
2,Base líquida,Roupas,75.02,34,Filial 8
3,Base líquida,Roupas,44.94,90,Filial 10
4,Lápis de sobrancelha,Alimentos,58.63,91,Filial 7

In [11]:
dados_json.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3123 entries, 0 to 3122
Data columns (total 5 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Nome do Produto        3123 non-null   object
 1   Categoria do Produto   3123 non-null   object
 2   Preço do Produto (R$)  3123 non-null   float64
 3   Quantidade em Estoque  3123 non-null   int64
 4   Filial                 3123 non-null   object
dtypes: float64(1), int64(1), object(3)
memory usage: 122.1+ KB

Renomeando colunas CSV

In [12]:
dados_csv.head()

,Nome do Item,Classificação do Produto,Valor em Reais (R$),Quantidade em Estoque,Nome da Loja,Data da Venda
0,Lápis de sobrancelha,Roupas,55.17,62,Filial 1,2023-04-13 18:58:06.794203
1,Batom matte,Eletrônicos,74.15,48,Filial 9,2023-06-03 18:58:06.794203
2,Corretivo,Roupas,54.86,36,Filial 5,2023-06-08 18:58:06.794203
3,Delineador líquido,Roupas,91.29,1,Filial 8,2023-02-27 18:58:06.794203
4,Batom líquido,Roupas,44.65,52,Filial 2,2022-09-05 18:58:06.794203

In [13]:
#Renomeando colunas
dados_csv.columns=['Nome do Produto', 'Categoria do Produto', 'Preço do Produto (R$)', 'Quantidade em Estoque', 'Filial', 'Data da Venda']

In [14]:
dados_csv.head()

,Nome do Produto,Categoria do Produto,Preço do Produto (R$),Quantidade em Estoque,Filial,Data da Venda
0,Lápis de sobrancelha,Roupas,55.17,62,Filial 1,2023-04-13 18:58:06.794203
1,Batom matte,Eletrônicos,74.15,48,Filial 9,2023-06-03 18:58:06.794203
2,Corretivo,Roupas,54.86,36,Filial 5,2023-06-08 18:58:06.794203
3,Delineador líquido,Roupas,91.29,1,Filial 8,2023-02-27 18:58:06.794203
4,Batom líquido,Roupas,44.65,52,Filial 2,2022-09-05 18:58:06.794203

Unindo as tabelas

In [15]:
dados_csv.shape

(1323, 6)

In [16]:
dados_json.shape

(3123, 5)

Neste caso não usaremos o Merge para unir as tabelas, mas sim o concat.

Merge: Utilizamos quando queremos combinar 2 ou mais tabelas através de uma coluna chave (Id por exemplo)

Concat: Utilizamos quando simplesmente queremos empilhar uma tabela sobre a outra

In [17]:
dados_combinados = pd.concat([dados_json, dados_csv], ignore_index=True)
#O argumento ignore_index=True reorganiza os índices para evitar duplicação.

In [18]:
dados_combinados.to_csv('../Data_Processed/dados_combinados.csv',index=False, encoding='utf-8')